Documents/абс_СертификатНаТовары/абс_СертификатНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_СертификатНаТовары</name>
  <registerRecords>InformationRegister.абс_ТоварыСертификатов</registerRecords>
  <attributes>
    <name>ДатаНачалаДействияСертификата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействияСертификата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Неактуальный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганСертификации</name>
    <type>
      <types>CatalogRef.абс_ОрганыСертификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСертификата</name>
    <type>
      <types>EnumRef.абс_ВидыСертификатовНаТовары</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлСертификата</name>
    <type>
      <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_ПоказательЭффективности</name>
    <type>
      <types>EnumRef.Лео_ОКК_СоответствиеПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ДатазаписиВБазу</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НоменклатураСертификата</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

InformationRegisters/абс_ТоварыСертификатов/абс_ТоварыСертификатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ТоварыСертификатов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаДействияСертификата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияДействияСертификата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСертификата</name>
    <type>
      <types>EnumRef.абс_ВидыСертификатовНаТовары</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Documents/абс_СертификатНаТовары/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект,Отказ);
	
	Если Неактуальный Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТаб ИЗ НоменклатураСертификата Цикл
		Движение = Движения.абс_ТоварыСертификатов.Добавить();
		Движение.Период                           = Лео_ДатазаписиВБазу;
		Движение.Номенклатура                     = СтрокаТаб.Номенклатура;
		//АБС 26.05.2014 44000
		Движение.ВидСертификата 				  = ВидСертификата;
		//АБС 26.05.2014 44000
		Движение.ДатаНачалаДействияСертификата    = ДатаНачалаДействияСертификата;
		Движение.ДатаОкончанияДействияСертификата = ДатаОкончанияДействияСертификата;
	КонецЦикла;
	
	Движения.абс_ТоварыСертификатов.Записывать = Истина;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	ДатаНачалаДействияСертификата = ТекущаяДата();
	
КонецПроцедуры
